{
  "id": "baseModal",
  "title": "Base Modal",
  "type": "abstract",
  "phpClass": "ilModalGUI",
  "externalLibrary": {
    "name": "Bootstrap Modal",
    "href": "http://getbootstrap.com/components/#modals"
  },
  "statusEntry": "Accepted by JF",
  "statusImplementation": "To be implemented",
  "description": [
    {
      "id": "purpose",
      "content": "The Modal forces users to focus on the task at hand."
    },
    {
      "id": "composition",
      "content": "A Modal is a full-screen dialog on top of the greyed-out ILIAS screen. The Modal consists of a header with a close button and a typography modal title, a content section and might have a footer."
    },
    {
      "id": "effect",
      "content": "All controls of the original context are inaccessible until the Modal is completed. Upon completion the user returns to the original context."
    },
    {
      "id": "rivalElements",
      "content": "Modals have some relations to popovers. The main difference between the two is the disruptive nature of the Modal and the larger amount of data that might be displayed inside a modal. Also popovers perform mostly action to add or consult metadata of an item while Modals manipulate or focus items or their sub-items directly."
    }
  ],
  "background": "http://quince.infragistics.com/Patterns/Modal%20Panel.aspx",
  "context": "",
  "featureWikiReferences":[
    "DR 5.2 - Pushing Modals",
    "DR 5.1 - Issue 02: Keep Drop-Downs in Viewport / Overlay handling"
  ],
  "rules":[
    "The main purpose of the Modals MUST NOT be navigational. But Modals MAY be dialogue of one or two steps and thus encompass “next”-buttons  or the like.",
    "Modals MUST NOT contain other modals (Modal in Modal).",
    "Modals SHOULD not be used to perform complex workflows.",
    "Modals MUST be closable by a little “x”-button on the right side of the header.",
    "Modals MUST contain a title in the header."
  ],
  "relations": {
    "isA": [],
    "mustUse": [
    ],
    "mayUse":[
    ]
  }
}